
&НаСервере
Процедура ЗАполнитьНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;  
	
	Пользователь1 =  ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПервыйПользователь.ИдентификаторПользователяИБ);
	Пользователь2 =  ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ВторойПользователь.ИдентификаторПользователяИБ);
	
	ТЧРоли.Очистить();
	Номер = 1;
	
	Для Каждого Роль Из Метаданные.Роли Цикл
		СтрНоваяСтрока = Новый Структура("Роль,Номер,ПервыйПользователь,ВторойПользователь,Номер");		
		СтрНоваяСтрока.Роль = Роль;
		СтрНоваяСтрока.Номер = Номер;
		Если Пользователь1.Роли.Содержит(Роль) Тогда
			СтрНоваяСтрока.ПервыйПользователь = Истина;
		Иначе
			СтрНоваяСтрока.ПервыйПользователь = Ложь;
		КонецЕсли; 
		Если Пользователь2.Роли.Содержит(Роль) Тогда
			СтрНоваяСтрока.ВторойПользователь = Истина;
		Иначе
			СтрНоваяСтрока.ВторойПользователь = Ложь;
		КонецЕсли; 
		Если СтрНоваяСтрока.ПервыйПользователь = Истина
			ИЛИ СтрНоваяСтрока.ВторойПользователь = Истина Тогда
			НоваяСтрока = ТЧРоли.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрНоваяСтрока);
			Номер = Номер + 1
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗАполнить(Команда)
	ЗАполнитьНаСервере();
КонецПроцедуры
